In [3]:
#Functional Programming

In [4]:
def check_palindrome(word):
    return word

In [5]:
check_palindrome('Ajay')

'Ajay'

In [6]:
a='lucky'
a[::-1]

'ykcul'

In [13]:
a='nitin'

if a==a[::-1]:
    print(f'{a} is a Palindrome')
else:
    print(f'{a} is Not a Palindrome')

nitin is a Palindrome

In [24]:
def check_palindrome(word:str):
    if type(word)==str:
        word= word.upper()
        if word== word[::-1]:
            return'Palindrome'
        else:
            return 'Not a Palindrome'
    else:
        return'Invalid Data Type'

In [26]:
check_palindrome('pop')

'Palindrome'

In [36]:
def give_fibo(n):
    fibo=[0,1]
    for i in range(n-2):
        last_num= fibo[-1]
        second_last_num= fibo[-2]
        next_num= last_num + second_last_num
        fibo.append(next_num)
    return fibo

In [37]:
print(give_fibo(10))

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [38]:
#prime number

In [172]:
def check_prime(number):
    for i in range(2,number):
        if number % i==0:
            return 'Not a Prime Number'
            break
    else:  
        return'Prime Number'

In [170]:
check_prime(78)

'Not a Prime Number'

In [54]:
#pattern

In [58]:
n=5
for i in range(1,n+1):
    print(i*'* ')

*
* *
* * *
* * * *
* * * * *

In [69]:
n=5
for i in range(1,n+1):
    print(' '*(n-i)+i*'* ')

    *
   * *
  * * *
 * * * *
* * * * *

In [95]:
def print_star(n=5,typ= 'left',shape='*'):
    if typ == 'left':
            space=''
            
    elif typ == 'right':
                    space='  '
                     
    elif typ == 'mid':
                    space=' '
        
    for i in range(1,n+1):
             print(' '*(n-i)+i*f'{shape} ')

     *
    * *
   * * *
  * * * *
 * * * * *
* * * * * *

In [96]:
print_star()

    *
   * *
  * * *
 * * * *
* * * * *

In [99]:
print_star(6,'mid','VIPS')

     VIPS
    VIPS VIPS
   VIPS VIPS VIPS
  VIPS VIPS VIPS VIPS
 VIPS VIPS VIPS VIPS VIPS
VIPS VIPS VIPS VIPS VIPS VIPS

In [100]:
#SUM OF NATURAL NUMBERS

In [104]:
def sum_of_n_natural_numbers(n):
    result = 0
    for i in range(1,n+1):
        result+=i
    return result

In [105]:
sum_of_n_natural_numbers(20)

210

In [109]:
def factorial(n):
    result=1
    for i in range(1,n+1):
            result*=i
    return result

In [110]:
factorial(10)

3628800

In [111]:
def total_sales(*args):
    #unpacking
    print(args)

In [113]:
total_sales(1,2,4,69,5,77)

(1, 2, 4, 69, 5, 77)

In [114]:
def total_sales(*args):
     #unpacking
     result=0
     for i in args:
            result+= i 
     return result

In [115]:
total_sales(1,2,5,66,33,99)

206

In [119]:
sales=[435,556,727,342,68,238,248]
#min(sales)

In [130]:
sales=[435,556,727,342,68,238,248]
min_element= sales[0]

for i in sales[1:]:
  if i< min_element:
     min_element=i
print(min_element)

68

In [131]:
max_element=sales[0]
for i in sales[1:]:
    if i>max_element:
        max_element=i
print(max_element)

727

In [138]:
def max_sales(*sales):
 sales=list(sales)
 max_element=sales[0]
for i in sales[1:]:
    if i>max_element:
        max_element=i
print(max_element)

727

In [139]:
sales(5555,2738,328,239)

TypeError: 'list' object is not callable

In [143]:
def min(*data):
    min_ele=data[0]
    for i in data[1:]:
        if i<min_ele:
            min_ele=i
    return min_ele

In [144]:
min(5555,2738,328,239)

239

In [145]:
def max(*data):
    max_ele=data[0]
    for i in data[1:]:
        if i>max_ele:
            max_ele=i
    return max_ele

In [146]:
max(5555,2738,328,239)

5555

In [147]:
company=['ola','uber','rapido','indrive','adani','tata']

def add_hashtag(*company):
    result=[]
    for i in company:
        result.append('#'+i.upper())
    return result

In [149]:
add_hashtag('apple')

['#APPLE']

In [150]:
add_hashtag(*company)

['#OLA', '#UBER', '#RAPIDO', '#INDRIVE', '#ADANI', '#TATA']

In [153]:
def store_records(name,age,sec,roll_no,Class):
    data={'Name':name,'Age':age,'Sec':sec,'Roll_NO':roll_no,'Class':Class}
    import pandas as pd
    result=pd.DataFrame(data,index=[1])
    return result

In [156]:
store_records('Samdish',20,'A',12,12)

      Name  Age Sec  Roll_NO  Class
1  Samdish   20   A       12     12

In [158]:
display(store_records('Samdish',20,'A',12,12))
display(store_records('Rachit',20,'A',12,12))
display(store_records('Yash',20,'A',12,12))

      Name  Age Sec  Roll_NO  Class
1  Samdish   20   A       12     12

     Name  Age Sec  Roll_NO  Class
1  Rachit   20   A       12     12

   Name  Age Sec  Roll_NO  Class
1  Yash   20   A       12     12

In [163]:
def students_records(**kwargs):
    import pandas as pd
    result=pd.DataFrame(kwargs,index=[1])
    return result

In [164]:
students_records(Name='Fazal',Age=20,sec='E2',Roll_No=62,Address='Delhi')

    Name  Age sec  Roll_No Address
1  Fazal   20  E2       62   Delhi